import Image from "next/image";
import styles from "./Footer.module.scss";
import logo from "@/public/images/logo.svg";
import Link from "next/link";
import { IContactsApiResponse } from "@/src/types/IContacts";

export const Footer = async () => {
  const res = await fetch(`${process.env.API_URL}/api/contact`);
  if (!res.ok) {
    throw new Error("Failed to fetch contacts");
  }

  const { data }: IContactsApiResponse = await res.json();

  return (
    <footer className={styles.footer}>
      <div className={`${styles.footerCOntainer} container`}>
        <div className={styles.wrapper}>
          <div className={styles.left}>
            <div className={styles.imgWrapper}>
              <Image src={logo} alt="Логотип" />
            </div>
            <p className={styles.text}>
              Эркиндик финанс осуществляет полный спектр профессиональной
              деятельности на европейском, американском, российском и кыргызском
              рынках ценных бумаг.
            </p>
            <ul className={styles.socialWrapper}>
              <li className={styles.socialItem}>
                <a className={styles.socialIcons} href="#">
                  <svg
                    width="7"
                    height="14"
                    viewBox="0 0 7 14"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <g clipPath="url(#clip0_12_264)">
                      <path
                        d="M1.78669 14V7.43079H-0.000244141V5.06556H1.78669V3.04535C1.78669 1.45785 2.84225 0 5.27446 0C6.25923 0 6.98742 0.09177 6.98742 0.09177L6.93004 2.30049C6.93004 2.30049 6.1874 2.29347 5.377 2.29347C4.49991 2.29347 4.35939 2.68638 4.35939 3.33851V5.06556H6.99976L6.88487 7.43079H4.35939V14H1.78669Z"
                        fill="white"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0_12_264">
                        <rect
                          width="7"
                          height="14"
                          fill="white"
                          transform="translate(-0.000244141)"
                        />
                      </clipPath>
                    </defs>
                  </svg>
                </a>
              </li>
              <li className={styles.socialItem}>
                <a className={styles.socialIcons} href="#">
                  <svg
                    width="18"
                    height="14"
                    viewBox="0 0 18 14"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <g clipPath="url(#clip0_12_260)">
                      <path
                        d="M17.9998 1.7049C17.3258 1.98937 16.6108 2.1761 15.8788 2.25887C16.6413 1.82346 17.2268 1.13398 17.5025 0.312468C16.7776 0.722276 15.9845 1.01101 15.1575 1.1662C14.4838 0.482477 13.5241 0.0551758 12.4619 0.0551758C10.4224 0.0551758 8.76891 1.63041 8.76891 3.57326C8.76891 3.84904 8.80161 4.11752 8.86454 4.37508C5.79539 4.22831 3.0743 2.82771 1.25286 0.699175C0.935043 1.21878 0.752934 1.82319 0.752934 2.46786C0.752934 3.68848 1.40494 4.76527 2.39579 5.39621C1.80934 5.37871 1.2358 5.22781 0.723051 4.95611C0.72284 4.97085 0.72284 4.98559 0.72284 5.00039C0.72284 6.70497 1.99578 8.12694 3.68511 8.45015C3.1413 8.59105 2.57088 8.61167 2.01743 8.51044C2.48733 9.90816 3.85118 10.9253 5.46711 10.9537C4.20324 11.8973 2.61087 12.4598 0.880762 12.4598C0.582637 12.4598 0.288731 12.4431 -0.000183105 12.4106C1.63409 13.4088 3.57521 13.9913 5.66068 13.9913C12.4534 13.9913 16.1678 8.63034 16.1678 3.98127C16.1678 3.82868 16.1642 3.67695 16.1571 3.5261C16.88 3.02819 17.5041 2.41147 17.9998 1.7049Z"
                        fill="white"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0_12_260">
                        <rect width="18" height="14" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                </a>
              </li>
              <li className={styles.socialItem}>
                <a className={styles.socialIcons} href="#">
                  <svg
                    width="16"
                    height="15"
                    viewBox="0 0 16 15"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <g clipPath="url(#clip0_12_256)">
                      <path
                        d="M3.63281 15V4.87953H0.202508V15H3.63281ZM1.9181 3.49692C3.11431 3.49692 3.85889 2.71978 3.85889 1.74862C3.8366 0.755565 3.11436 0 1.9408 0C0.767434 0 0.00012207 0.75558 0.00012207 1.74862C0.00012207 2.71983 0.74452 3.49692 1.89571 3.49692H1.918H1.9181ZM5.53147 15H8.96177V9.34824C8.96177 9.04576 8.98406 8.7436 9.07465 8.52738C9.32263 7.92304 9.88705 7.29712 10.8346 7.29712C12.0759 7.29712 12.5725 8.2252 12.5725 9.5857V14.9999H16.0026V9.19695C16.0026 6.08834 14.3103 4.64193 12.0533 4.64193C10.2028 4.64193 9.39033 5.65626 8.93895 6.34712H8.96185V4.87932H5.53155C5.57657 5.82897 5.53155 14.9998 5.53155 14.9998L5.53147 15Z"
                        fill="white"
                      />
                    </g>
                    <defs>
                      <clipPath id="clip0_12_256">
                        <rect width="16" height="15" fill="white" />
                      </clipPath>
                    </defs>
                  </svg>
                </a>
              </li>
              <li className={styles.socialItem}>
                <a className={styles.socialIcons} href="#">
                  <svg
                    width="16"
                    height="16"
                    viewBox="0 0 16 16"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M8.00368 3.95708C5.73225 3.95708 3.90011 5.76059 3.90011 7.99653C3.90011 10.2325 5.73225 12.036 8.00368 12.036C10.2751 12.036 12.1073 10.2325 12.1073 7.99653C12.1073 5.76059 10.2751 3.95708 8.00368 3.95708ZM8.00368 10.6227C6.53583 10.6227 5.33583 9.44497 5.33583 7.99653C5.33583 6.54809 6.53225 5.37036 8.00368 5.37036C9.47511 5.37036 10.6715 6.54809 10.6715 7.99653C10.6715 9.44497 9.47154 10.6227 8.00368 10.6227ZM13.2322 3.79184C13.2322 4.31567 12.8037 4.73403 12.2751 4.73403C11.743 4.73403 11.318 4.31216 11.318 3.79184C11.318 3.27153 11.7465 2.84966 12.2751 2.84966C12.8037 2.84966 13.2322 3.27153 13.2322 3.79184ZM15.9501 4.74809C15.8894 3.48598 15.5965 2.36802 14.6572 1.44692C13.7215 0.52583 12.5858 0.237549 11.3037 0.174268C9.98225 0.100439 6.02154 0.100439 4.70011 0.174268C3.42154 0.234033 2.28583 0.522314 1.34654 1.44341C0.407258 2.3645 0.117972 3.48247 0.0536865 4.74458C-0.0213135 6.04536 -0.0213135 9.94418 0.0536865 11.245C0.114401 12.5071 0.407258 13.625 1.34654 14.5461C2.28583 15.4672 3.41797 15.7555 4.70011 15.8188C6.02154 15.8926 9.98225 15.8926 11.3037 15.8188C12.5858 15.759 13.7215 15.4707 14.6572 14.5461C15.593 13.625 15.8858 12.5071 15.9501 11.245C16.0251 9.94418 16.0251 6.04887 15.9501 4.74809ZM14.243 12.6407C13.9644 13.3297 13.4251 13.8606 12.7215 14.1383C11.668 14.5497 9.16797 14.4547 8.00368 14.4547C6.8394 14.4547 4.33583 14.5461 3.28583 14.1383C2.58583 13.8641 2.04654 13.3332 1.7644 12.6407C1.34654 11.6036 1.44297 9.14262 1.44297 7.99653C1.44297 6.85044 1.35011 4.38598 1.7644 3.35239C2.04297 2.66333 2.58226 2.13247 3.28583 1.85474C4.3394 1.44341 6.8394 1.53833 8.00368 1.53833C9.16797 1.53833 11.6715 1.44692 12.7215 1.85474C13.4215 2.12895 13.9608 2.65981 14.243 3.35239C14.6608 4.3895 14.5644 6.85044 14.5644 7.99653C14.5644 9.14262 14.6608 11.6071 14.243 12.6407Z"
                      fill="white"
                    />
                  </svg>
                </a>
              </li>
            </ul>
          </div>
          <ul className={styles.list}>
            <li className={styles.item}>
              <h5 className={styles.innerTitle}>Страницы</h5>
              <Link className={styles.link} href="">
                Главная
              </Link>
              <Link className={styles.link} href="">
                О нас
              </Link>
              <Link className={styles.link} href="">
                Услуги
              </Link>
              <Link className={styles.link} href="">
                Контакты
              </Link>
              <Link className={styles.link} href="">
                Документы
              </Link>
            </li>
            <li className={styles.item}>
              <h5 className={styles.innerTitle}>Услуги</h5>
              <Link className={styles.link} href="">
                Покупка/продажа
              </Link>
              <Link className={styles.link} href="">
                Ценные бумаги
              </Link>
              <Link className={styles.link} href="">
                Конвертация
              </Link>
            </li>
            <li className={styles.item}>
              <h5 className={styles.innerTitle}>Контакты</h5>
              {data.phone ? (
                <a
                  className={`${styles.link} ${styles.contacts}`}
                  href={`tel:+${data.phone}`}
                >
                  <span>
                    <svg
                      width="20"
                      height="20"
                      viewBox="0 0 20 20"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M1.24375 3.39531L3.73984 0.901563C3.91592 0.724712 4.1252 0.584392 4.35567 0.488665C4.58614 0.392938 4.83325 0.34369 5.08281 0.34375C5.5914 0.34375 6.06953 0.542969 6.42812 0.901563L9.11406 3.5875C9.29091 3.76358 9.43123 3.97286 9.52696 4.20333C9.62269 4.4338 9.67193 4.68091 9.67187 4.93047C9.67187 5.43906 9.47266 5.91719 9.11406 6.27578L7.15 8.23984C7.60974 9.25319 8.24893 10.175 9.03672 10.9609C9.82253 11.7506 10.7443 12.3922 11.7578 12.8547L13.7219 10.8906C13.898 10.7138 14.1072 10.5735 14.3377 10.4777C14.5682 10.382 14.8153 10.3328 15.0648 10.3328C15.5734 10.3328 16.0516 10.532 16.4102 10.8906L19.0984 13.5742C19.2755 13.7506 19.4159 13.9603 19.5117 14.1912C19.6074 14.4221 19.6565 14.6696 19.6562 14.9195C19.6562 15.4281 19.457 15.9062 19.0984 16.2648L16.607 18.7562C16.0352 19.3305 15.2453 19.6562 14.4344 19.6562C14.2633 19.6562 14.0992 19.6422 13.9375 19.6141C10.7781 19.0938 7.64453 17.4133 5.11562 14.8867C2.58906 12.3625 0.910936 9.23125 0.383593 6.0625C0.224218 5.09453 0.545311 4.09844 1.24375 3.39531Z"
                        fill="white"
                      />
                    </svg>
                  </span>
                  +{data.phone}
                </a>
              ) : (
                <p className={styles.noData}>Телефон: Нет данных</p>
              )}
              {data.email ? (
                <a
                  className={`${styles.link} ${styles.contacts}`}
                  href={`mailto:${data.email}`}
                  target="_blank"
                >
                  <span>
                    <svg
                      width="20"
                      height="20"
                      viewBox="0 0 21 16"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M2.644 0.800049H18.544C20.044 0.800049 20.8 1.50805 20.8 2.94805V13.052C20.8 14.48 20.044 15.2 18.544 15.2H2.644C1.144 15.2 0.388 14.48 0.388 13.052V2.94805C0.388 1.50805 1.144 0.800049 2.644 0.800049ZM10.588 11.12L18.676 4.48405C18.964 4.24405 19.192 3.69205 18.832 3.20005C18.484 2.70805 17.848 2.69605 17.428 2.99605L10.588 7.62805L3.76 2.99605C3.34 2.69605 2.704 2.70805 2.356 3.20005C1.996 3.69205 2.224 4.24405 2.512 4.48405L10.588 11.12Z"
                        fill="white"
                      />
                    </svg>
                  </span>
                  {data.email}
                </a>
              ) : (
                <p className={styles.noData}>Email: Нет данных</p>
              )}
              {data.address ? (
                <a
                  className={`${styles.link} ${styles.contacts}`}
                  target="_blank"
                  href={data.addressLink}
                >
                  <span>
                    <svg
                      width="20"
                      height="20"
                      viewBox="0 0 14 19"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <path
                        d="M6.13594 18.525C4.23281 16.1426 0 10.3684 0 7.125C0 3.18992 3.13396 0 7 0C10.8646 0 14 3.18992 14 7.125C14 10.3684 9.73438 16.1426 7.86406 18.525C7.41562 19.0928 6.58437 19.0928 6.13594 18.525ZM7 9.5C8.28698 9.5 9.33333 8.43496 9.33333 7.125C9.33333 5.81504 8.28698 4.75 7 4.75C5.71302 4.75 4.66667 5.81504 4.66667 7.125C4.66667 8.43496 5.71302 9.5 7 9.5Z"
                        fill="white"
                      />
                    </svg>
                  </span>
                  {data.address}
                </a>
              ) : (
                <p className={styles.noData}>Адрес: Нет данных</p>
              )}
            </li>
          </ul>
        </div>
      </div>
    </footer>
  );
};
